public class TaskFour {

    /*
    Дана скобочная последовательность: [((())()(())]]
            - Можно ли считать эту последовательность правильной?
            - Если ответ на предыдущий вопрос “нет” - то что необходимо в ней изменить, чтоб она стала правильной?

    Ответ:
        - данную последовательность нельзя считать правильной, т.к. количество и тип открывающихся и закрывающихся скобок отличается
        - чтобы данная последовательность стала правильной необходимо добавить одну '[' вначале и одну ')' после любой из существующих ')', т.е.:
            [[((()))()(())]] или [[((())())(())]] или [[((())()(()))]]
     */

}
